RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_enet_regs.h
/*
 * TWOKPE (RW)
 *
 * IEEE 802.3as Support for 2K Packets
 *  When set, the MAC considers all frames, with up to 2,000 bytes length, as normal packets.
 * When Bit 20 (JE) is not set, the MAC considers all received frames of size more than 2K bytes as Giant frames.
 * When this bit is reset and Bit 20 (JE) is not set, the MAC considers all received frames of size more than 1,518 bytes (1,522 bytes for tagged) as Giant frames.
 * When Bit 20 is set, setting this bit has no effect on Giant Frame status.
 */
#define ENET_MACCFG_TWOKPE_MASK (0x8000000UL)
#define ENET_MACCFG_TWOKPE_SHIFT (27U)
#define ENET_MACCFG_TWOKPE_SET(x) (((uint32_t)(x) << ENET_MACCFG_TWOKPE_SHIFT) & ENET_MACCFG_TWOKPE_MASK)
#define ENET_MACCFG_TWOKPE_GET(x) (((uint32_t)(x) & ENET_MACCFG_TWOKPE_MASK) >> ENET_MACCFG_TWOKPE_SHIFT)

/*
 * SFTERR (RW)
 *
 * SMII Force Transmit Error
 *  When set, this bit indicates to the PHY to force a transmit error in the SMII frame being transmitted. This bit is reserved if the SMII PHY port is not selected during core configuration.
 */
#define ENET_MACCFG_SFTERR_MASK (0x4000000UL)
#define ENET_MACCFG_SFTERR_SHIFT (26U)
#define ENET_MACCFG_SFTERR_SET(x) (((uint32_t)(x) << ENET_MACCFG_SFTERR_SHIFT) & ENET_MACCFG_SFTERR_MASK)
#define ENET_MACCFG_SFTERR_GET(x) (((uint32_t)(x) & ENET_MACCFG_SFTERR_MASK) >> ENET_MACCFG_SFTERR_SHIFT)

/*
 * CST (RW)
 *
 * CRC Stripping for Type Frames
 *  When this bit is set, the last 4 bytes (FCS) of all frames of Ether type (Length/Type field greater than or equal to 1,536) are stripped and dropped before forwarding the frame to the application.
 * This function is not valid when the IP Checksum Engine (Type 1) is enabled in the MAC receiver. This function is valid when Type 2 Checksum Offload Engine is enabled.
 */
#define ENET_MACCFG_CST_MASK (0x2000000UL)
#define ENET_MACCFG_CST_SHIFT (25U)
#define ENET_MACCFG_CST_SET(x) (((uint32_t)(x) << ENET_MACCFG_CST_SHIFT) & ENET_MACCFG_CST_MASK)
#define ENET_MACCFG_CST_GET(x) (((uint32_t)(x) & ENET_MACCFG_CST_MASK) >> ENET_MACCFG_CST_SHIFT)

/*
 * TC (RW)
 *
 * Transmit Configuration in RGMII, SGMII, or SMII
 *  When set, this bit enables the transmission of duplex mode, link speed, and link up or down information to the PHY in the RGMII, SMII,
 *  or SGMII port. When this bit is reset, no such information is driven to the PHY.
 * This bit is reserved (and RO) if the RGMII, SMII, or SGMII PHY port is not selected during core configuration.
 */
#define ENET_MACCFG_TC_MASK (0x1000000UL)
#define ENET_MACCFG_TC_SHIFT (24U)
#define ENET_MACCFG_TC_SET(x) (((uint32_t)(x) << ENET_MACCFG_TC_SHIFT) & ENET_MACCFG_TC_MASK)
#define ENET_MACCFG_TC_GET(x) (((uint32_t)(x) & ENET_MACCFG_TC_MASK) >> ENET_MACCFG_TC_SHIFT)

/*
 * WD (RW)
 *
 * Watchdog Disable
 *  When this bit is set, the MAC disables the watchdog timer on the receiver. The MAC can receive frames of up to 16,383 bytes.
 */
#define ENET_MACCFG_WD_MASK (0x800000UL)
#define ENET_MACCFG_WD_SHIFT (23U)
#define ENET_MACCFG_WD_SET(x) (((uint32_t)(x) << ENET_MACCFG_WD_SHIFT) & ENET_MACCFG_WD_MASK)
#define ENET_MACCFG_WD_GET(x) (((uint32_t)(x) & ENET_MACCFG_WD_MASK) >> ENET_MACCFG_WD_SHIFT)

/*
 * JD (RW)
 *
 * Jabber Disable
 *  When this bit is set, the MAC disables the jabber timer on the transmitter. The MAC can transfer frames of up to 16,383 bytes.
 * When this bit is reset, the MAC cuts off the transmitter if the application sends out more than 2,048 bytes of data (10,240 if JE is set high) during transmission.
 */
#define ENET_MACCFG_JD_MASK (0x400000UL)
#define ENET_MACCFG_JD_SHIFT (22U)
#define ENET_MACCFG_JD_SET(x) (((uint32_t)(x) << ENET_MACCFG_JD_SHIFT) & ENET_MACCFG_JD_MASK)
#define ENET_MACCFG_JD_GET(x) (((uint32_t)(x) & ENET_MACCFG_JD_MASK) >> ENET_MACCFG_JD_SHIFT)

/*
 * BE (RW)
 *
 * Frame Burst Enable
 *  When this bit is set, the MAC allows frame bursting during transmission in the GMII half-duplex mode. This bit is reserved (and RO) in the 10/100 Mbps only or full-duplex-only configurations.
 */
#define ENET_MACCFG_BE_MASK (0x200000UL)
#define ENET_MACCFG_BE_SHIFT (21U)
#define ENET_MACCFG_BE_SET(x) (((uint32_t)(x) << ENET_MACCFG_BE_SHIFT) & ENET_MACCFG_BE_MASK)
#define ENET_MACCFG_BE_GET(x) (((uint32_t)(x) & ENET_MACCFG_BE_MASK) >> ENET_MACCFG_BE_SHIFT)

/*
 * JE (RW)
 *
 * Jumbo Frame Enable
 *  When this bit is set, the MAC allows Jumbo frames of 9,018 bytes (9,022 bytes for VLAN tagged frames) without reporting a giant frame error in the receive frame status.
 */
#define ENET_MACCFG_JE_MASK (0x100000UL)
#define ENET_MACCFG_JE_SHIFT (20U)
#define ENET_MACCFG_JE_SET(x) (((uint32_t)(x) << ENET_MACCFG_JE_SHIFT) & ENET_MACCFG_JE_MASK)
#define ENET_MACCFG_JE_GET(x) (((uint32_t)(x) & ENET_MACCFG_JE_MASK) >> ENET_MACCFG_JE_SHIFT)

/*
 * IFG (RW)
 *
 * Inter-Frame Gap
 *  These bits control the minimum IFG between frames during transmission.
 * - 000: 96 bit times
 * - 001: 88 bit times
 * - 010: 80 bit times - ...
 * - 111: 40 bit times In the half-duplex mode, the minimum IFG can be configured only for 64 bit times (IFG = 100).
 * Lower values are not considered.
 * In the 1000-Mbps mode, the minimum IFG supported is 64 bit times (and above) in the GMAC-CORE configuration and 80 bit times (and above) in other configurations.
 *  When a JAM pattern is being transmitted because of backpressure activation, the MAC does not consider the minimum IFG.
 */
#define ENET_MACCFG_IFG_MASK (0xE0000UL)
#define ENET_MACCFG_IFG_SHIFT (17U)
#define ENET_MACCFG_IFG_SET(x) (((uint32_t)(x) << ENET_MACCFG_IFG_SHIFT) & ENET_MACCFG_IFG_MASK)
#define ENET_MACCFG_IFG_GET(x) (((uint32_t)(x) & ENET_MACCFG_IFG_MASK) >> ENET_MACCFG_IFG_SHIFT)

/*
 * DCRS (RW)
 *
 * Disable Carrier Sense During Transmission
 *  When set high, this bit makes the MAC transmitter ignore the (G)MII CRS signal during frame transmission in the half-duplex mode.
 *  This request results in no errors generated because of Loss of Carrier or No Carrier during such transmission.
 * When this bit is low, the MAC transmitter generates such errors because of Carrier Sense and can even abort the transmissions.
 */
#define ENET_MACCFG_DCRS_MASK (0x10000UL)
#define ENET_MACCFG_DCRS_SHIFT (16U)
#define ENET_MACCFG_DCRS_SET(x) (((uint32_t)(x) << ENET_MACCFG_DCRS_SHIFT) & ENET_MACCFG_DCRS_MASK)
#define ENET_MACCFG_DCRS_GET(x) (((uint32_t)(x) & ENET_MACCFG_DCRS_MASK) >> ENET_MACCFG_DCRS_SHIFT)

