RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_enet_regs.h
/*
 * DZPQ (RW)
 *
 * Disable Zero-Quanta Pause
 *  When this bit is set, it disables the automatic generation of the Zero-Quanta Pause frames on the de-assertion of
 * the flow-control signal from the FIFO layer (MTL or external sideband flow control signal sbd_flowctrl_i/mti_flowctrl_i).
 * When this bit is reset, normal operation with automatic Zero-Quanta Pause frame generation is enabled.
 */
#define ENET_FLOWCTRL_DZPQ_MASK (0x80U)
#define ENET_FLOWCTRL_DZPQ_SHIFT (7U)
#define ENET_FLOWCTRL_DZPQ_SET(x) (((uint32_t)(x) << ENET_FLOWCTRL_DZPQ_SHIFT) & ENET_FLOWCTRL_DZPQ_MASK)
#define ENET_FLOWCTRL_DZPQ_GET(x) (((uint32_t)(x) & ENET_FLOWCTRL_DZPQ_MASK) >> ENET_FLOWCTRL_DZPQ_SHIFT)

/*
 * PLT (RW)
 *
 * Pause Low Threshold
 *  This field configures the threshold of the Pause timer at which the input flow control signal mti_flowctrl_i (or sbd_flowctrl_i) is checked for automatic retransmission of the Pause frame.
 * The threshold values should be always less than the Pause Time configured in Bits[31:16].
 *  For example, if PT = 100H (256 slot-times), and PLT = 01,
 * then a second Pause frame is automatically transmitted if the mti_flowctrl_i signal is asserted at 228 (256 – 28) slot times after the first Pause frame is transmitted.
 * The following list provides the threshold values for different values:
 * - 00: The threshold is Pause time minus 4 slot times (PT – 4 slot times).
 * - 01: The threshold is Pause time minus 28 slot times (PT – 28 slot times).
 * - 10: The threshold is Pause time minus 144 slot times (PT – 144 slot times).
 * - 11: The threshold is Pause time minus 256 slot times (PT – 256 slot times). The slot time is defined as the time taken to transmit 512 bits (64 bytes) on the GMII or MII interface.
 */
#define ENET_FLOWCTRL_PLT_MASK (0x30U)
#define ENET_FLOWCTRL_PLT_SHIFT (4U)
#define ENET_FLOWCTRL_PLT_SET(x) (((uint32_t)(x) << ENET_FLOWCTRL_PLT_SHIFT) & ENET_FLOWCTRL_PLT_MASK)
#define ENET_FLOWCTRL_PLT_GET(x) (((uint32_t)(x) & ENET_FLOWCTRL_PLT_MASK) >> ENET_FLOWCTRL_PLT_SHIFT)

/*
 * UP (RW)
 *
 * Unicast Pause Frame Detect A pause frame is processed when it has the unique multicast address specified in the IEEE Std 802.3.
 * When this bit is set, the MAC can also detect Pause frames with unicast address of the station.
 * This unicast address should be as specified in the MAC Address0 High Register and MAC Address0 Low Register.
 * When this bit is reset, the MAC only detects Pause frames with unique multicast address.
 */
#define ENET_FLOWCTRL_UP_MASK (0x8U)
#define ENET_FLOWCTRL_UP_SHIFT (3U)
#define ENET_FLOWCTRL_UP_SET(x) (((uint32_t)(x) << ENET_FLOWCTRL_UP_SHIFT) & ENET_FLOWCTRL_UP_MASK)
#define ENET_FLOWCTRL_UP_GET(x) (((uint32_t)(x) & ENET_FLOWCTRL_UP_MASK) >> ENET_FLOWCTRL_UP_SHIFT)

/*
 * RFE (RW)
 *
 * Receive Flow Control Enable
 *  When this bit is set, the MAC decodes the received Pause frame and disables its transmitter for a specified (Pause) time. When this bit is reset, the decode function of the Pause frame is disabled.
 */
#define ENET_FLOWCTRL_RFE_MASK (0x4U)
#define ENET_FLOWCTRL_RFE_SHIFT (2U)
#define ENET_FLOWCTRL_RFE_SET(x) (((uint32_t)(x) << ENET_FLOWCTRL_RFE_SHIFT) & ENET_FLOWCTRL_RFE_MASK)
#define ENET_FLOWCTRL_RFE_GET(x) (((uint32_t)(x) & ENET_FLOWCTRL_RFE_MASK) >> ENET_FLOWCTRL_RFE_SHIFT)

/*
 * TFE (RW)
 *
 * Transmit Flow Control Enable
 * In the full-duplex mode, when this bit is set, the MAC enables the flow control operation to transmit Pause frames.
 * When this bit is reset, the flow control operation in the MAC is disabled, and the MAC does not transmit any Pause frames.
 * In the half-duplex mode, when this bit is set, the MAC enables the backpressure operation. When this bit is reset, the backpressure feature is disabled.
 */
#define ENET_FLOWCTRL_TFE_MASK (0x2U)
#define ENET_FLOWCTRL_TFE_SHIFT (1U)
#define ENET_FLOWCTRL_TFE_SET(x) (((uint32_t)(x) << ENET_FLOWCTRL_TFE_SHIFT) & ENET_FLOWCTRL_TFE_MASK)
#define ENET_FLOWCTRL_TFE_GET(x) (((uint32_t)(x) & ENET_FLOWCTRL_TFE_MASK) >> ENET_FLOWCTRL_TFE_SHIFT)

/*
 * FCB_BPA (RW)
 *
 * Flow Control Busy or Backpressure Activate
 *  This bit initiates a Pause frame in the full-duplex mode and activates the backpressure function in the half-duplex mode if the TFE bit is set.
 * In the full-duplex mode, this bit should be read as 1'b0 before writing to the Flow Control register.
 *  To initiate a Pause frame, the Application must set this bit to 1'b1.
 * During a transfer of the Control Frame, this bit continues to be set to signify that a frame transmission is in progress.
 * After the completion of Pause frame transmission, the MAC resets this bit to 1'b0.
 * The Flow Control register should not be written to until this bit is cleared. In the half-duplex mode,
 * when this bit is set (and TFE is set), then backpressure is asserted by the MAC.
 * During backpressure, when the MAC receives a new frame, the transmitter starts sending a JAM pattern resulting in a collision.
 * This control register bit is logically ORed with the mti_flowctrl_i input signal for the backpressure function.
 * When the MAC is configured for the full-duplex mode, the BPA is automatically disabled.
 */
#define ENET_FLOWCTRL_FCB_BPA_MASK (0x1U)
#define ENET_FLOWCTRL_FCB_BPA_SHIFT (0U)
#define ENET_FLOWCTRL_FCB_BPA_SET(x) (((uint32_t)(x) << ENET_FLOWCTRL_FCB_BPA_SHIFT) & ENET_FLOWCTRL_FCB_BPA_MASK)
#define ENET_FLOWCTRL_FCB_BPA_GET(x) (((uint32_t)(x) & ENET_FLOWCTRL_FCB_BPA_MASK) >> ENET_FLOWCTRL_FCB_BPA_SHIFT)

/* Bitfield definition for register: VLAN_TAG */
/*
 * VTHM (RW)
 *
 * VLAN Tag Hash Table Match Enable
 *  When set, the most significant four bits of the VLAN tag’s CRC are used to index the content of Register 354 (VLAN Hash Table Register).
 * A value of 1 in the VLAN Hash Table register, corresponding to the index, indicates that the frame matched the VLAN hash table.
 * When Bit 16 (ETV) is set, the CRC of the 12-bit VLAN Identifier (VID) is used for comparison whereas when ETV is reset,
 * the CRC of the 16-bit VLAN tag is used for comparison. When reset, the VLAN Hash Match operation is not performed.
 */
#define ENET_VLAN_TAG_VTHM_MASK (0x80000UL)
#define ENET_VLAN_TAG_VTHM_SHIFT (19U)
#define ENET_VLAN_TAG_VTHM_SET(x) (((uint32_t)(x) << ENET_VLAN_TAG_VTHM_SHIFT) & ENET_VLAN_TAG_VTHM_MASK)
#define ENET_VLAN_TAG_VTHM_GET(x) (((uint32_t)(x) & ENET_VLAN_TAG_VTHM_MASK) >> ENET_VLAN_TAG_VTHM_SHIFT)

