RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_enet_regs.h
/*
 * TLPIST (RW)
 *
 * Transmit LPI State
 * When set, this bit indicates that the MAC is transmitting the LPI pattern on the GMII or MII interface.
 */
#define ENET_LPI_CSR_TLPIST_MASK (0x100U)
#define ENET_LPI_CSR_TLPIST_SHIFT (8U)
#define ENET_LPI_CSR_TLPIST_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_TLPIST_SHIFT) & ENET_LPI_CSR_TLPIST_MASK)
#define ENET_LPI_CSR_TLPIST_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_TLPIST_MASK) >> ENET_LPI_CSR_TLPIST_SHIFT)

/*
 * RLPIEX (RW)
 *
 * Receive LPI Exit
 * When set, this bit indicates that the MAC Receiver has stopped receiving the LPI pattern on the GMII or MII interface, exited the LPI state, and resumed the normal reception.
 * This bit is cleared by a read into this register.
 * Note: This bit may not get set if the MAC stops receiving the LPI pattern for a very short duration, such as, less than 3 clock cycles of CSR clock.
 */
#define ENET_LPI_CSR_RLPIEX_MASK (0x8U)
#define ENET_LPI_CSR_RLPIEX_SHIFT (3U)
#define ENET_LPI_CSR_RLPIEX_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_RLPIEX_SHIFT) & ENET_LPI_CSR_RLPIEX_MASK)
#define ENET_LPI_CSR_RLPIEX_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_RLPIEX_MASK) >> ENET_LPI_CSR_RLPIEX_SHIFT)

/*
 * RLPIEN (RW)
 *
 * Receive LPI Entry
 * When set, this bit indicates that the MAC Receiver has received an LPI pattern and entered the LPI state. This bit is cleared by a read into this register.
 * Note: This bit may not get set if the MAC stops receiving the LPI pattern for a very short duration, such as, less than 3 clock cycles of CSR clock.
 */
#define ENET_LPI_CSR_RLPIEN_MASK (0x4U)
#define ENET_LPI_CSR_RLPIEN_SHIFT (2U)
#define ENET_LPI_CSR_RLPIEN_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_RLPIEN_SHIFT) & ENET_LPI_CSR_RLPIEN_MASK)
#define ENET_LPI_CSR_RLPIEN_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_RLPIEN_MASK) >> ENET_LPI_CSR_RLPIEN_SHIFT)

/*
 * TLPIEX (RW)
 *
 * Transmit LPI Exit
 * When set, this bit indicates that the MAC transmitter has exited the LPI state after the user has cleared the LPIEN bit and the LPI TW Timer has expired. This bit is cleared by a read into this register.
 */
#define ENET_LPI_CSR_TLPIEX_MASK (0x2U)
#define ENET_LPI_CSR_TLPIEX_SHIFT (1U)
#define ENET_LPI_CSR_TLPIEX_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_TLPIEX_SHIFT) & ENET_LPI_CSR_TLPIEX_MASK)
#define ENET_LPI_CSR_TLPIEX_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_TLPIEX_MASK) >> ENET_LPI_CSR_TLPIEX_SHIFT)

/*
 * TLPIEN (RW)
 *
 * Transmit LPI Entry
 *  When set, this bit indicates that the MAC Transmitter has entered the LPI state because of the setting of the LPIEN bit. This bit is cleared by a read into this register.
 */
#define ENET_LPI_CSR_TLPIEN_MASK (0x1U)
#define ENET_LPI_CSR_TLPIEN_SHIFT (0U)
#define ENET_LPI_CSR_TLPIEN_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_TLPIEN_SHIFT) & ENET_LPI_CSR_TLPIEN_MASK)
#define ENET_LPI_CSR_TLPIEN_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_TLPIEN_MASK) >> ENET_LPI_CSR_TLPIEN_SHIFT)

/* Bitfield definition for register: LPI_TCR */
/*
 * LST (RW)
 *
 * LPI LS TIMER
 * This field specifies the minimum time (in milliseconds) for which the link status from the PHY should be up (OKAY) before the LPI pattern can be transmitted to the PHY.
 *  The MAC does not transmit the LPI pattern even when the LPIEN bit is set unless the LPI LS Timer reaches the programmed terminal count.
 * The default value of the LPI LS Timer is 1000 (1 sec) as defined in the IEEE standard.
 */
#define ENET_LPI_TCR_LST_MASK (0x3FF0000UL)
#define ENET_LPI_TCR_LST_SHIFT (16U)
#define ENET_LPI_TCR_LST_SET(x) (((uint32_t)(x) << ENET_LPI_TCR_LST_SHIFT) & ENET_LPI_TCR_LST_MASK)
#define ENET_LPI_TCR_LST_GET(x) (((uint32_t)(x) & ENET_LPI_TCR_LST_MASK) >> ENET_LPI_TCR_LST_SHIFT)

/*
 * TWT (RW)
 *
 * LPI TW TIMER
 * This field specifies the minimum time (in microseconds) for which the MAC waits after it stops transmitting
 *  the LPI pattern to the PHY and before it resumes the normal transmission.
 * The TLPIEX status bit is set after the expiry of this timer.
 */
#define ENET_LPI_TCR_TWT_MASK (0xFFFFU)
#define ENET_LPI_TCR_TWT_SHIFT (0U)
#define ENET_LPI_TCR_TWT_SET(x) (((uint32_t)(x) << ENET_LPI_TCR_TWT_SHIFT) & ENET_LPI_TCR_TWT_MASK)
#define ENET_LPI_TCR_TWT_GET(x) (((uint32_t)(x) & ENET_LPI_TCR_TWT_MASK) >> ENET_LPI_TCR_TWT_SHIFT)

/* Bitfield definition for register: INTR_STATUS */
/*
 * GPIIS (RO)
 *
 * GPI Interrupt Status
 * When the GPIO feature is enabled, this bit is set when any active event (LL or LH) occurs on the GPIS field (Bits [3:0])
 *  of Register 56 (General Purpose IO Register) and the corresponding GPIE bit is enabled.
 * This bit is cleared on reading lane 0 (GPIS) of Register 56 (General Purpose IO Register).
 *  When the GPIO feature is not enabled, this bit is reserved.
 */
#define ENET_INTR_STATUS_GPIIS_MASK (0x800U)
#define ENET_INTR_STATUS_GPIIS_SHIFT (11U)
#define ENET_INTR_STATUS_GPIIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_GPIIS_MASK) >> ENET_INTR_STATUS_GPIIS_SHIFT)

/*
 * LPIIS (RO)
 *
 * LPI Interrupt Status
 * When the Energy Efficient Ethernet feature is enabled, this bit is set for any LPI state entry or exit in the MAC Transmitter or Receiver.
 * This bit is cleared on reading Bit 0 of Register 12 (LPI Control and Status Register). In all other modes, this bit is reserved.
 */
#define ENET_INTR_STATUS_LPIIS_MASK (0x400U)
#define ENET_INTR_STATUS_LPIIS_SHIFT (10U)
#define ENET_INTR_STATUS_LPIIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_LPIIS_MASK) >> ENET_INTR_STATUS_LPIIS_SHIFT)

/*
 * TSIS (RO)
 *
 * Timestamp Interrupt Status
 * When the Advanced Timestamp feature is enabled, this bit is set when any of the following conditions is true:
 * - The system time value equals or exceeds the value specified in the Target Time High and Low registers.
 * - There is an overflow in the seconds register.
 *  - The Auxiliary snapshot trigger is asserted. This bit is cleared on reading Bit 0 of Register 458 (Timestamp Status Register).
 */
#define ENET_INTR_STATUS_TSIS_MASK (0x200U)
#define ENET_INTR_STATUS_TSIS_SHIFT (9U)
#define ENET_INTR_STATUS_TSIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_TSIS_MASK) >> ENET_INTR_STATUS_TSIS_SHIFT)

