RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_enet_regs.h
/*
 * PCSLCHGIM (RW)
 *
 * PCS Link Status Interrupt Mask
 * When set, this bit disables the assertion of the interrupt signal because of the setting of the PCS Link-status changed bit in Register 14 (Interrupt Status Register).
 */
#define ENET_INTR_MASK_PCSLCHGIM_MASK (0x2U)
#define ENET_INTR_MASK_PCSLCHGIM_SHIFT (1U)
#define ENET_INTR_MASK_PCSLCHGIM_SET(x) (((uint32_t)(x) << ENET_INTR_MASK_PCSLCHGIM_SHIFT) & ENET_INTR_MASK_PCSLCHGIM_MASK)
#define ENET_INTR_MASK_PCSLCHGIM_GET(x) (((uint32_t)(x) & ENET_INTR_MASK_PCSLCHGIM_MASK) >> ENET_INTR_MASK_PCSLCHGIM_SHIFT)

/*
 * RGSMIIIM (RW)
 *
 * RGMII or SMII Interrupt Mask
 * When set, this bit disables the assertion of the interrupt signal because of the setting of the RGMII or SMII Interrupt Status bit in Register 14 (Interrupt Status Register).
 */
#define ENET_INTR_MASK_RGSMIIIM_MASK (0x1U)
#define ENET_INTR_MASK_RGSMIIIM_SHIFT (0U)
#define ENET_INTR_MASK_RGSMIIIM_SET(x) (((uint32_t)(x) << ENET_INTR_MASK_RGSMIIIM_SHIFT) & ENET_INTR_MASK_RGSMIIIM_MASK)
#define ENET_INTR_MASK_RGSMIIIM_GET(x) (((uint32_t)(x) & ENET_INTR_MASK_RGSMIIIM_MASK) >> ENET_INTR_MASK_RGSMIIIM_SHIFT)

/* Bitfield definition for register: MAC_ADDR_0_HIGH */
/*
 * AE (RO)
 *
 * Address Enable
 *  This bit is RO. The bit value is fixed at 1.
 */
#define ENET_MAC_ADDR_0_HIGH_AE_MASK (0x80000000UL)
#define ENET_MAC_ADDR_0_HIGH_AE_SHIFT (31U)
#define ENET_MAC_ADDR_0_HIGH_AE_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_0_HIGH_AE_MASK) >> ENET_MAC_ADDR_0_HIGH_AE_SHIFT)

/*
 * ADDRHI (RW)
 *
 * MAC Address0 [47:32]
 *  This field contains the upper 16 bits (47:32) of the first 6-byte MAC address. The MAC uses this field for filtering the received frames and inserting the MAC address in the Transmit Flow Control (Pause) Frames.
 */
#define ENET_MAC_ADDR_0_HIGH_ADDRHI_MASK (0xFFFFU)
#define ENET_MAC_ADDR_0_HIGH_ADDRHI_SHIFT (0U)
#define ENET_MAC_ADDR_0_HIGH_ADDRHI_SET(x) (((uint32_t)(x) << ENET_MAC_ADDR_0_HIGH_ADDRHI_SHIFT) & ENET_MAC_ADDR_0_HIGH_ADDRHI_MASK)
#define ENET_MAC_ADDR_0_HIGH_ADDRHI_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_0_HIGH_ADDRHI_MASK) >> ENET_MAC_ADDR_0_HIGH_ADDRHI_SHIFT)

/* Bitfield definition for register: MAC_ADDR_0_LOW */
/*
 * ADDRLO (RW)
 *
 * MAC Address0 [31:0]
 *  This field contains the lower 32 bits of the first 6-byte MAC address. This is used by the MAC for filtering the received frames and inserting the MAC address in the Transmit Flow Control (Pause) Frames.
 */
#define ENET_MAC_ADDR_0_LOW_ADDRLO_MASK (0xFFFFFFFFUL)
#define ENET_MAC_ADDR_0_LOW_ADDRLO_SHIFT (0U)
#define ENET_MAC_ADDR_0_LOW_ADDRLO_SET(x) (((uint32_t)(x) << ENET_MAC_ADDR_0_LOW_ADDRLO_SHIFT) & ENET_MAC_ADDR_0_LOW_ADDRLO_MASK)
#define ENET_MAC_ADDR_0_LOW_ADDRLO_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_0_LOW_ADDRLO_MASK) >> ENET_MAC_ADDR_0_LOW_ADDRLO_SHIFT)

/* Bitfield definition for register of struct array MAC_ADDR: HIGH */
/*
 * AE (RW)
 *
 * Address Enable
 * When this bit is set, the address filter module uses the second MAC address for perfect filtering. When this bit is reset, the address filter module ignores the address for filtering.
 */
#define ENET_MAC_ADDR_HIGH_AE_MASK (0x80000000UL)
#define ENET_MAC_ADDR_HIGH_AE_SHIFT (31U)
#define ENET_MAC_ADDR_HIGH_AE_SET(x) (((uint32_t)(x) << ENET_MAC_ADDR_HIGH_AE_SHIFT) & ENET_MAC_ADDR_HIGH_AE_MASK)
#define ENET_MAC_ADDR_HIGH_AE_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_HIGH_AE_MASK) >> ENET_MAC_ADDR_HIGH_AE_SHIFT)

/*
 * SA (RW)
 *
 * Source Address
 * When this bit is set, the MAC Address1[47:0] is used to compare with the SA fields of the received frame. When this bit is reset, the MAC Address1[47:0] is used to compare with the DA fields of the received frame.
 */
#define ENET_MAC_ADDR_HIGH_SA_MASK (0x40000000UL)
#define ENET_MAC_ADDR_HIGH_SA_SHIFT (30U)
#define ENET_MAC_ADDR_HIGH_SA_SET(x) (((uint32_t)(x) << ENET_MAC_ADDR_HIGH_SA_SHIFT) & ENET_MAC_ADDR_HIGH_SA_MASK)
#define ENET_MAC_ADDR_HIGH_SA_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_HIGH_SA_MASK) >> ENET_MAC_ADDR_HIGH_SA_SHIFT)

/*
 * MBC (RW)
 *
 * Mask Byte Control
 * These bits are mask control bits for comparison of each of the MAC Address bytes.
 * When set high, the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers.
 * Each bit controls the masking of the bytes as follows:
 * - Bit 29: Register 18[15:8]
 * - Bit 28: Register 18[7:0]
 * - Bit 27: Register 19[31:24] -
 * ...
 * - Bit 24: Register 19[7:0]
 * You can filter a group of addresses (known as group address filtering) by masking one or more bytes of the address.
 */
#define ENET_MAC_ADDR_HIGH_MBC_MASK (0x3F000000UL)
#define ENET_MAC_ADDR_HIGH_MBC_SHIFT (24U)
#define ENET_MAC_ADDR_HIGH_MBC_SET(x) (((uint32_t)(x) << ENET_MAC_ADDR_HIGH_MBC_SHIFT) & ENET_MAC_ADDR_HIGH_MBC_MASK)
#define ENET_MAC_ADDR_HIGH_MBC_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_HIGH_MBC_MASK) >> ENET_MAC_ADDR_HIGH_MBC_SHIFT)

/*
 * ADDRHI (RW)
 *
 * MAC Address1 [47:32]
 * This field contains the upper 16 bits (47:32) of the second 6-byte MAC address.
 */
#define ENET_MAC_ADDR_HIGH_ADDRHI_MASK (0xFFFFU)
#define ENET_MAC_ADDR_HIGH_ADDRHI_SHIFT (0U)
#define ENET_MAC_ADDR_HIGH_ADDRHI_SET(x) (((uint32_t)(x) << ENET_MAC_ADDR_HIGH_ADDRHI_SHIFT) & ENET_MAC_ADDR_HIGH_ADDRHI_MASK)
#define ENET_MAC_ADDR_HIGH_ADDRHI_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_HIGH_ADDRHI_MASK) >> ENET_MAC_ADDR_HIGH_ADDRHI_SHIFT)

/* Bitfield definition for register of struct array MAC_ADDR: LOW */
/*
 * ADDRLO (RW)
 *
 * MAC Address1 [31:0]
 * This field contains the lower 32 bits of the second 6-byte MAC address. The content of this field is undefined until loaded by the Application after the initialization process.
 */
#define ENET_MAC_ADDR_LOW_ADDRLO_MASK (0xFFFFFFFFUL)
#define ENET_MAC_ADDR_LOW_ADDRLO_SHIFT (0U)
#define ENET_MAC_ADDR_LOW_ADDRLO_SET(x) (((uint32_t)(x) << ENET_MAC_ADDR_LOW_ADDRLO_SHIFT) & ENET_MAC_ADDR_LOW_ADDRLO_MASK)
#define ENET_MAC_ADDR_LOW_ADDRLO_GET(x) (((uint32_t)(x) & ENET_MAC_ADDR_LOW_ADDRLO_MASK) >> ENET_MAC_ADDR_LOW_ADDRLO_SHIFT)

