RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_enet_regs.h
/*
 * TS (RW)
 *
 * Transmit Process State
 * This field indicates the Transmit DMA FSM state. This field does not generate an interrupt.
 * - 3’b000: Stopped; Reset or Stop Transmit Command issued
 * - 3’b001: Running; Fetching Transmit Transfer Descriptor
 * - 3’b010: Running; Waiting for status
 * - 3’b011: Running; Reading Data from host memory buffer and queuing it to transmit buffer (Tx FIFO)
 * - 3’b100: TIME_STAMP write state
 * - 3’b101: Reserved for future use
 * - 3’b110: Suspended; Transmit Descriptor Unavailable or Transmit Buffer Underflow
 * - 3’b111: Running; Closing Transmit Descriptor
 */
#define ENET_DMA_STATUS_TS_MASK (0x700000UL)
#define ENET_DMA_STATUS_TS_SHIFT (20U)
#define ENET_DMA_STATUS_TS_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_TS_SHIFT) & ENET_DMA_STATUS_TS_MASK)
#define ENET_DMA_STATUS_TS_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_TS_MASK) >> ENET_DMA_STATUS_TS_SHIFT)

/*
 * RS (RW)
 *
 * Receive Process State
 * This field indicates the Receive DMA FSM state. This field does not generate an interrupt.
 * - 3’b000: Stopped: Reset or Stop Receive Command issued
 * - 3’b001: Running: Fetching Receive Transfer Descriptor
 * - 3’b010: Reserved for future use
 * - 3’b011: Running: Waiting for receive packet
 * - 3’b100: Suspended: Receive Descriptor Unavailable
 * - 3’b101: Running: Closing Receive Descriptor
 * - 3’b110: TIME_STAMP write state
 * - 3’b111: Running: Transferring the receive packet data from receive buffer to host memory
 */
#define ENET_DMA_STATUS_RS_MASK (0xE0000UL)
#define ENET_DMA_STATUS_RS_SHIFT (17U)
#define ENET_DMA_STATUS_RS_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_RS_SHIFT) & ENET_DMA_STATUS_RS_MASK)
#define ENET_DMA_STATUS_RS_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_RS_MASK) >> ENET_DMA_STATUS_RS_SHIFT)

/*
 * NIS (RW)
 *
 * Normal Interrupt Summary
 * Normal Interrupt Summary bit value is the logical OR of the following bits when the corresponding interrupt bits are enabled in
 * Register 7 (Interrupt Enable Register):
 * - Register 5[0]: Transmit Interrupt
 * - Register 5[2]: Transmit Buffer Unavailable
 * - Register 5[6]: Receive Interrupt
 * - Register 5[14]: Early Receive Interrupt Only unmasked bits
 *  (interrupts for which interrupt enable is set in Register 7) affect the Normal Interrupt Summary bit.
 *  This is a sticky bit and must be cleared (by writing 1 to this bit) each time a corresponding bit, which causes NIS to be set, is cleared.
 */
#define ENET_DMA_STATUS_NIS_MASK (0x10000UL)
#define ENET_DMA_STATUS_NIS_SHIFT (16U)
#define ENET_DMA_STATUS_NIS_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_NIS_SHIFT) & ENET_DMA_STATUS_NIS_MASK)
#define ENET_DMA_STATUS_NIS_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_NIS_MASK) >> ENET_DMA_STATUS_NIS_SHIFT)

/*
 * AIS (RW)
 *
 * Abnormal Interrupt Summary
 * Abnormal Interrupt Summary bit value is the logical OR of the following
 * when the corresponding interrupt bits are enabled in Register 7 (Interrupt Enable Register):
 * - Register 5[1]: Transmit Process Stopped
 * - Register 5[3]: Transmit Jabber Timeout
 * - Register 5[4]: Receive FIFO Overflow
 * - Register 5[5]: Transmit Underflow
 * - Register 5[7]: Receive Buffer Unavailable
 * - Register 5[8]: Receive Process Stopped
 * - Register 5[9]: Receive Watchdog Timeout
 * - Register 5[10]: Early Transmit Interrupt
 * - Register 5[13]: Fatal Bus Error Only unmasked bits affect the Abnormal Interrupt Summary bit.
 * This is a sticky bit and must be cleared (by writing 1 to this bit) each time a corresponding bit, which causes AIS to be set, is cleared.
 */
#define ENET_DMA_STATUS_AIS_MASK (0x8000U)
#define ENET_DMA_STATUS_AIS_SHIFT (15U)
#define ENET_DMA_STATUS_AIS_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_AIS_SHIFT) & ENET_DMA_STATUS_AIS_MASK)
#define ENET_DMA_STATUS_AIS_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_AIS_MASK) >> ENET_DMA_STATUS_AIS_SHIFT)

/*
 * ERI (RW)
 *
 * Early Receive Interrupt
 * This bit indicates that the DMA filled the first data buffer of the packet. This bit is cleared when the software writes 1 to this bit or Bit 6 (RI) of this register is set (whichever occurs earlier).
 */
#define ENET_DMA_STATUS_ERI_MASK (0x4000U)
#define ENET_DMA_STATUS_ERI_SHIFT (14U)
#define ENET_DMA_STATUS_ERI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_ERI_SHIFT) & ENET_DMA_STATUS_ERI_MASK)
#define ENET_DMA_STATUS_ERI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_ERI_MASK) >> ENET_DMA_STATUS_ERI_SHIFT)

/*
 * FBI (RW)
 *
 * Fatal Bus Error Interrupt
 * This bit indicates that a bus error occurred, as described in Bits [25:23]. When this bit is set, the corresponding DMA engine disables all of its bus accesses.
 */
#define ENET_DMA_STATUS_FBI_MASK (0x2000U)
#define ENET_DMA_STATUS_FBI_SHIFT (13U)
#define ENET_DMA_STATUS_FBI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_FBI_SHIFT) & ENET_DMA_STATUS_FBI_MASK)
#define ENET_DMA_STATUS_FBI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_FBI_MASK) >> ENET_DMA_STATUS_FBI_SHIFT)

/*
 * ETI (RW)
 *
 * Early Transmit Interrupt
 * This bit indicates that the frame to be transmitted is fully transferred to the MTL Transmit FIFO.
 */
#define ENET_DMA_STATUS_ETI_MASK (0x400U)
#define ENET_DMA_STATUS_ETI_SHIFT (10U)
#define ENET_DMA_STATUS_ETI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_ETI_SHIFT) & ENET_DMA_STATUS_ETI_MASK)
#define ENET_DMA_STATUS_ETI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_ETI_MASK) >> ENET_DMA_STATUS_ETI_SHIFT)

/*
 * RWT (RW)
 *
 * Receive Watchdog Timeout
 * When set, this bit indicates that the Receive Watchdog Timer expired while receiving the current frame and the current frame is truncated after the watchdog timeout.
 */
#define ENET_DMA_STATUS_RWT_MASK (0x200U)
#define ENET_DMA_STATUS_RWT_SHIFT (9U)
#define ENET_DMA_STATUS_RWT_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_RWT_SHIFT) & ENET_DMA_STATUS_RWT_MASK)
#define ENET_DMA_STATUS_RWT_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_RWT_MASK) >> ENET_DMA_STATUS_RWT_SHIFT)

/*
 * RPS (RW)
 *
 * Receive Process Stopped
 * This bit is asserted when the Receive Process enters the Stopped state.
 */
#define ENET_DMA_STATUS_RPS_MASK (0x100U)
#define ENET_DMA_STATUS_RPS_SHIFT (8U)
#define ENET_DMA_STATUS_RPS_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_RPS_SHIFT) & ENET_DMA_STATUS_RPS_MASK)
#define ENET_DMA_STATUS_RPS_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_RPS_MASK) >> ENET_DMA_STATUS_RPS_SHIFT)

